In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [4]:
# Pandas Series
data = np.random.random(10) * 20
series = pd.Series(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [5]:
series

a     5.392428
b     9.977582
c    19.254443
d    14.864275
e    12.693144
f    16.588247
g    12.603754
h    14.652760
i    11.859718
j     2.912434
dtype: float64

In [17]:
# DataFrames

data = {
    "Id" : [101,102,103,104,105,106,107,108,109,110],
    "Names" : ["Ram", "Shyam", "Amit", "Ravi", "Gopal", "Manish", "Pooja", "Jyoti", "John", "Sachin"],
    "CompanyName" : ["Adobe", "Google", "BMPL", "BMPL", "Microsoft", "Adobe", "Genpact", "Accenture", "IBM", "Google"]
}
df = pd.DataFrame(data, index=data['Id'])

In [18]:
df

    CompanyName   Id   Names
101       Adobe  101     Ram
102      Google  102   Shyam
103        BMPL  103    Amit
104        BMPL  104    Ravi
105   Microsoft  105   Gopal
106       Adobe  106  Manish
107     Genpact  107   Pooja
108   Accenture  108   Jyoti
109         IBM  109    John
110      Google  110  Sachin

In [21]:
df['CompanyName']

101        Adobe
102       Google
103         BMPL
104         BMPL
105    Microsoft
106        Adobe
107      Genpact
108    Accenture
109          IBM
110       Google
Name: CompanyName, dtype: object

In [22]:
df.head()

    CompanyName   Id  Names
101       Adobe  101    Ram
102      Google  102  Shyam
103        BMPL  103   Amit
104        BMPL  104   Ravi
105   Microsoft  105  Gopal

In [23]:
df.tail()

    CompanyName   Id   Names
106       Adobe  106  Manish
107     Genpact  107   Pooja
108   Accenture  108   Jyoti
109         IBM  109    John
110      Google  110  Sachin

In [24]:
df.head(3)

    CompanyName   Id  Names
101       Adobe  101    Ram
102      Google  102  Shyam
103        BMPL  103   Amit

In [31]:
df[df['Id'] > 105]

    CompanyName   Id   Names
106       Adobe  106  Manish
107     Genpact  107   Pooja
108   Accenture  108   Jyoti
109         IBM  109    John
110      Google  110  Sachin

In [32]:
df[df['CompanyName'] == 'Google']

    CompanyName   Id   Names
102      Google  102   Shyam
110      Google  110  Sachin

In [33]:
df[df['CompanyName'] == 'BMPL']

    CompanyName   Id Names
103        BMPL  103  Amit
104        BMPL  104  Ravi